sm00th/rp2040-oled/src/rp2040-oled.c
/*
 * SPDX-License-Identifier: MIT
 * Copyright 2023, Artem Savkov
 */

#include <stdlib.h>
#include <string.h>
#include "hardware/gpio.h"
#include "hardware/i2c.h"
#include "pico/error.h"

#include "rp2040-oled.h"
#include "rp2040-oled-internal.h"

static void rp2040_i2c_init(rp2040_oled_t *oled)
{
        i2c_init(oled->i2c, oled->baudrate);

        gpio_set_function(oled->sda_pin, GPIO_FUNC_I2C);
        gpio_set_function(oled->scl_pin, GPIO_FUNC_I2C);

        gpio_pull_up(oled->sda_pin);
        gpio_pull_up(oled->scl_pin);
}

static uint8_t *rp2040_oled_alloc_data_buf(size_t size)
{
        uint8_t *buf;

        buf = malloc(size + 1);
        memset(buf, 0x00, size + 1);
        buf[0] = OLED_CB_DATA_BIT;

        return buf + 1;
}

static void rp2040_oled_free_data_buf(uint8_t *buf)
{
        free(buf - 1);
}

static bool rp2040_i2c_test_addr(rp2040_oled_t *oled, uint8_t addr)
{
        uint8_t buf;
        int ret;

        ret = i2c_read_blocking(oled->i2c, addr, &buf, 1, false);
        return ret != PICO_ERROR_GENERIC;
}

static int rp2040_i2c_read_register(rp2040_oled_t *oled, uint8_t reg, uint8_t *data, size_t len)
{
        int ret;

        ret = i2c_write_blocking(oled->i2c, oled->addr, &reg, 1, true);
        if (ret < 0)
                return ret;

        ret = i2c_read_blocking(oled->i2c, oled->addr, data, len, false);
        return ret;
}

static size_t rp2040_i2c_write(rp2040_oled_t *oled, const uint8_t *data, size_t len)
{
        uint8_t buf[32];
        size_t sent = 0;
        size_t ret = 0;
        uint8_t leftover;
        while (len - sent >= 32) {
                if (sent == 0) {
                        memcpy(buf, data, 32);
                        data += 32;
                        sent += 32;
                } else {
                        buf[0] = OLED_CB_DATA_BIT;
                        memcpy(buf + 1, data, 31);
                        data += 31;
                        sent += 31;
                }
                ret = i2c_write_blocking(oled->i2c, oled->addr, buf, 32, true);
        }

        leftover = len - sent;
        if (leftover == len) {
                ret = i2c_write_blocking(oled->i2c, oled->addr, data, len, true);
                return ret == len ? ret : -1;

        }
        if (leftover > 0) {
                buf[0] = OLED_CB_DATA_BIT;
                memcpy(buf + 1 , data, leftover);
                ret = i2c_write_blocking(oled->i2c, oled->addr, buf, leftover + 1, true);
                if (ret != (leftover + 1))
                        return -1;

                sent += leftover;
        }

        return sent;
}

static bool rp2040_oled_write_command(rp2040_oled_t *oled, uint8_t cmd)
{
        uint8_t buf[] = { 0x00, cmd };
        return rp2040_i2c_write(oled, buf, sizeof(buf)) == sizeof(buf);
}

static bool rp2040_oled_write_command_with_arg(rp2040_oled_t *oled, uint8_t cmd, uint8_t arg)
{
        uint8_t buf[] = { 0x00, cmd, arg };
        return rp2040_i2c_write(oled, buf, sizeof(buf)) == sizeof(buf);
}

static bool rp2040_oled_set_position(rp2040_oled_t *oled, uint8_t x, uint8_t y)
{
        uint8_t buf[4];

        y /= PAGE_BITS;

        if (oled->size == OLED_64x32) {
                x += 32;
                if (oled->flip == 0)
                        y += 4;
        } else if (oled->size == OLED_132x64) {
                x += 2;
        } else if (oled->size == OLED_96x16) {
                if (oled->flip == 0)
                        y += 2;
                else
                        x += 32;
        } else if (oled->size == OLED_72x40) {
                x += 28;
                if (oled->flip == 0)
                        y += 3;
        }

        buf[0] = 0x00;
        buf[1] = OLED_CMD_SET_PAGE_ADDR | y;
        buf[2] = OLED_CMD_SET_LC_ADDR | (x & 0x0f);
        buf[3] = OLED_CMD_SET_HC_ADDR | (x >> 4);

        oled->cursor.x = x;
        oled->cursor.y = y;

        return rp2040_i2c_write(oled, buf, sizeof(buf)) == sizeof(buf);
}

static bool rp2040_oled_write_gdram(rp2040_oled_t *oled, uint8_t *buf, size_t size,
                                    rp2040_oled_color_t color, bool render)
{
        size_t gdram_offset = oled->cursor.x + (oled->cursor.y * oled->width);

        if (oled->cursor.x + size > oled->width)
                return false;

        if (color != OLED_COLOR_FULL_BYTE) {
                for (size_t i = 0; i < size; i++) {
                        if (color == OLED_COLOR_WHITE)
                                buf[i] = buf[i] | *(oled->gdram + gdram_offset + i);
                        else if (color == OLED_COLOR_BLACK)
                                buf[i] = buf[i] & *(oled->gdram + gdram_offset + i);
                }
        }
        memcpy(oled->gdram + gdram_offset, buf, size);

        if (!render) {
                if (!oled->dirty_area.is_dirty) {
                        oled->dirty_area.is_dirty = true;
                        oled->dirty_area.y0 = oled->cursor.y;
                        oled->dirty_area.y1 = oled->cursor.y;
                        oled->dirty_area.x0 = oled->cursor.x;
                        oled->dirty_area.x1 = oled->cursor.x + size;
                } else {
                        if (oled->cursor.y < oled->dirty_area.y0)
                                oled->dirty_area.y0 = oled->cursor.y;
                        if (oled->cursor.y > oled->dirty_area.y1)
                                oled->dirty_area.y1 = oled->cursor.y;

                        if (oled->cursor.x < oled->dirty_area.x0)
                                oled->dirty_area.x0 = oled->cursor.x;
                        if (oled->cursor.x > oled->dirty_area.x1)
                                oled->dirty_area.x1 = oled->cursor.x;
                }
        }

        oled->cursor.x += size;

        if (!render)
                return true;

        return rp2040_i2c_write(oled, buf - 1, size + 1) == size + 1;
}

bool rp2040_oled_flush(rp2040_oled_t *oled)
{
        uint8_t *buf;
        uint8_t width = oled->dirty_area.x1 - oled->dirty_area.x0 + 1;

        if (!oled->dirty_area.is_dirty)
                return true;

