sm00th/rp2040-oled/src/rp2040-oled.c
        if (oled->reset_pin != PIN_UNDEF) {
                gpio_set_dir(oled->reset_pin, GPIO_OUT);
                rp2040_oled_reset(oled);
        }

        if (oled->addr == PIN_UNDEF || oled->addr == 0x00) {
                oled->addr = rp2040_oled_scan(oled);
                if (oled->addr == PIN_UNDEF)
                        return OLED_NOT_FOUND;
        } else if (!rp2040_i2c_test_addr(oled, oled->addr)) {
                return OLED_NOT_FOUND;
        }

        type = rp2040_oled_autodetect(oled);

        rp2040_oled_display_init(oled);

        return type;
}

static bool rp2040_oled_fill(rp2040_oled_t *oled, uint8_t fill_byte)
{
        uint8_t *fill_buf;
        size_t fill_buf_size = oled->width;

        fill_buf = rp2040_oled_alloc_data_buf(fill_buf_size);
        memset(fill_buf, fill_byte, fill_buf_size);

        for (uint8_t y = 0; y < oled->height; y += PAGE_BITS) {
                if (!rp2040_oled_set_position(oled, 0, y)) {
                        rp2040_oled_free_data_buf(fill_buf);
                        return false;
                }

                if (!rp2040_oled_write_gdram(oled, fill_buf, fill_buf_size, OLED_COLOR_FULL_BYTE, true)) {
                        rp2040_oled_free_data_buf(fill_buf);
                        return false;
                }
        }

        rp2040_oled_free_data_buf(fill_buf);
        return true;
}

bool rp2040_oled_set_contrast(rp2040_oled_t *oled, uint8_t contrast)
{
        return rp2040_oled_write_command_with_arg(oled, OLED_CMD_SET_CONTRAST, contrast);
}

bool rp2040_oled_set_power(rp2040_oled_t *oled, bool enabled)
{
        return rp2040_oled_write_command(oled, enabled ? OLED_CMD_DISPLAY_ON : OLED_CMD_DISPLAY_OFF);
}

bool rp2040_oled_write_string(rp2040_oled_t *oled, uint8_t x, uint8_t y, char *msg, size_t len)
{
        uint8_t *buf;
        size_t buf_size = len * 6;
        size_t i = 0;
        if (x >= oled->width || y >= oled->height)
                return false;

        if (!rp2040_oled_set_position(oled, x, y))
                return false;

        buf = rp2040_oled_alloc_data_buf(buf_size);

        for (i = 0; i < len; i++) {
                uint8_t font_index = msg[i] - 32;

                buf[i * 6] = 0x00;
                memcpy(buf + (1 + (i * 6)), font_6x8 + (font_index * 5), 5);
        }

        if (!rp2040_oled_write_gdram(oled, buf, buf_size, OLED_COLOR_WHITE, true)) {
                rp2040_oled_free_data_buf(buf);
                return false;
        }

        rp2040_oled_free_data_buf(buf);
        return true;
}

bool rp2040_oled_set_pixel(rp2040_oled_t *oled, uint8_t x, uint8_t y,
                           rp2040_oled_color_t color, bool render)
{
        bool ret = true;
        uint8_t page = y / PAGE_BITS;
        uint8_t page_offset = y % PAGE_BITS;
        uint8_t bit_mask = 1 << page_offset;
        uint8_t buf[2] = {OLED_CB_DATA_BIT, 0x00};

        if (x >= oled->width || y >= oled->height)
                return false;

        buf[1] = oled->gdram[x + (page * oled->width)];
        if (color == OLED_COLOR_WHITE)
                buf[1] |= bit_mask;
        else if (OLED_COLOR_BLACK)
                buf[1] &= ~bit_mask;
        else
                return false;

        if (!rp2040_oled_set_position(oled, x, page * PAGE_BITS))
                return false;

        if (!rp2040_oled_write_gdram(oled, buf + 1, 1, color, render))
                ret = false;

        return ret;
}

bool rp2040_oled_draw_line(rp2040_oled_t *oled, uint8_t x0, uint8_t y0,
                           uint8_t x1, uint8_t y1, rp2040_oled_color_t color) {
        int16_t dx = abs(x1 - x0);
        int16_t dy = -abs(y1 - y0);
        int8_t sx = x0 < x1 ? 1 : -1;
        int8_t sy = y0 < y1 ? 1 : -1;
        int16_t err = dx + dy;
        int16_t err2;
        uint8_t bit_mask = 0x00;
        uint8_t buf[2] = {OLED_CB_DATA_BIT, 0x00};

        if (x0 < 0 || x1 < 0 || y0 < 0 || y1 < 0 || x0 >= oled->width ||
            x1 >= oled->width || y0 >= oled->height || y1 >= oled->height)
                return false;

        if (x0 == x1) {
                if (y0 / PAGE_BITS == y1 / PAGE_BITS) {
                        for (uint8_t y = y0; y != y1; y += sy) {
                                bit_mask |= 1 << (sy == 1 ? y % PAGE_BITS : PAGE_BITS - y % PAGE_BITS);
                        }
                        rp2040_oled_set_position(oled, x0, y0);
                        buf[1] = bit_mask;
                        rp2040_oled_write_gdram(oled, buf + 1, 1, color, true);
                } else {
                        uint8_t tshift, bshift, y;
                        if (y0 > y1) {
                                y = y1;
                                y1 = y0;
                                y0 = y;
                        }

                        tshift = PAGE_BITS - y0 % PAGE_BITS;
                        bshift = y1 % PAGE_BITS;
                        y = y0;

                        if (tshift) {
                                bit_mask = 0x00;
                                for (uint8_t i = 0; i < tshift; i++) {
                                        bit_mask |= 1 << ((PAGE_BITS - 1) - i);
                                }
                                rp2040_oled_set_position(oled, x0, y);
                                buf[1] = bit_mask;
                                rp2040_oled_write_gdram(oled, buf + 1, 1, color, false);
                                y += tshift;
                        }

                        buf[1] = 0xff;
                        while (y / PAGE_BITS < y1 / PAGE_BITS) {
                                rp2040_oled_set_position(oled, x0, y);
                                rp2040_oled_write_gdram(oled, buf + 1, 1, color, false);
                                y += PAGE_BITS;
                        }

                        if (bshift) {
                                bit_mask = 0x00;
                                for (uint8_t i = 0; i < bshift; i++) {
                                        bit_mask |= 1 << i;
                                }
                                rp2040_oled_set_position(oled, x0, y);
                                buf[1] = bit_mask;
                                rp2040_oled_write_gdram(oled, buf + 1, 1, color, false);
                                y += bshift;
                        }

                        rp2040_oled_flush(oled);
                }
                return true;
        }

        while(1) {
                rp2040_oled_set_pixel(oled, x0, y0, color, false);
                if (x0 == x1 && y0 == y1)
                        break;

