sm00th/rp2040-oled/src/rp2040-oled.c
                err2 = 2 * err;
                if (err2 >= dy) {
                        if (x0 == x1)
                                break;
                        err = err + dy;
                        x0 = x0 + sx;
                }

                if (err2 <= dx) {
                        if (y0 == y1)
                                break;
                        err = err + dx;
                        y0 = y0 + sy;
                }
                
        }
        rp2040_oled_flush(oled);
        return true;
}

bool rp2040_oled_clear(rp2040_oled_t *oled)
{
        return rp2040_oled_fill(oled, 0x00);
}

bool rp2040_oled_draw_sprite(rp2040_oled_t *oled, const uint8_t *sprite, int16_t x,
                             int16_t y, uint8_t width, uint8_t height, rp2040_oled_color_t color)
{
        bool ret = true;
        uint8_t *buf;
        size_t buf_size;
        uint8_t orig_width = width;
        const uint8_t *final_sprite = sprite;
        uint8_t orig_pages, final_pages;
        uint8_t *osprite = NULL;
        size_t osprite_size;
        uint8_t xshift = 0, yshift = 0;

        if (x + width < 0 || y + height < 0)
                return false;

        if (x < 0) {
                width += x;
                xshift = -x;
                x = 0;
        }

        if (y < 0) {
                height += y;
                yshift = -y;
                y = 0;
        }

        if (x + width > oled->width)
                width = oled->width - x;

        if (y + height > oled->height)
                height = oled->height - y;

        orig_pages = (height + PAGE_BITS - 1) / PAGE_BITS;
        final_pages = orig_pages;

        if ((y % PAGE_BITS != 0) || yshift != 0) {
                uint8_t yoffset = (y + yshift) % PAGE_BITS;
                uint8_t pshift = yshift / PAGE_BITS;
                final_pages = (height + yoffset + PAGE_BITS - 1) / PAGE_BITS;
                osprite_size = orig_width * final_pages;
                osprite = malloc(osprite_size);
                memset(osprite, 0x00, osprite_size);
                final_sprite = osprite;
                for (uint8_t cur_page = 0; cur_page < final_pages; cur_page++) {
                        for (uint8_t cur_x = 0; cur_x < orig_width; cur_x++) {
                                if (y != 0) {
                                        if ((cur_page) > 0)
                                                osprite[cur_x + cur_page * orig_width] |= sprite[cur_x + (cur_page - 1) * orig_width] >> (PAGE_BITS - yoffset);

                                        if (cur_page < orig_pages)
                                                osprite[cur_x + cur_page * orig_width] |= sprite[cur_x + cur_page * orig_width] << yoffset;
                                } else {
                                        osprite[cur_x + cur_page * orig_width] |= sprite[cur_x + (pshift + cur_page) * orig_width] >> yoffset;

                                        if (cur_page < orig_pages)
                                                osprite[cur_x + cur_page * orig_width] |= sprite[cur_x + (pshift + cur_page + 1) * orig_width] << (PAGE_BITS - yoffset);
                                }
                        }
                }
        }

        buf_size = width;
        buf = rp2040_oled_alloc_data_buf(buf_size);

        for (uint8_t cur_page = 0; cur_page < final_pages; cur_page++) {
                if (!rp2040_oled_set_position(oled, x, y + cur_page * PAGE_BITS)) {
                        ret = false;
                        goto out;
                }
                memcpy(buf, final_sprite + xshift + (cur_page * orig_width), width);
                //memcpy(buf, final_sprite + xshift + ((yshift + cur_page) * orig_width), width);
                if (cur_page == final_pages - 1 && (y + height) % PAGE_BITS) {
                        uint8_t mask = 0x00;
                        for (uint8_t i = 0; i < (y + height) % PAGE_BITS; i++) {
                                mask |= 1 << i;
                        }

                        for (uint8_t i = 0; i < width; i++) {
                                *(buf + i) &= mask;
                        }
                }
                if (!rp2040_oled_write_gdram(oled, buf, buf_size, color, true)) {
                        ret = false;
                        goto out;
                }
        }

out:
        rp2040_oled_free_data_buf(buf);
        if (osprite)
                free(osprite);
        return ret;
}

bool rp2040_oled_draw_sprite_pitched(rp2040_oled_t *oled, uint8_t *sprite, int16_t x,
                                     int16_t y, uint8_t width, uint8_t height, uint8_t pitch,
                                     rp2040_oled_color_t color)
{
        bool ret = true;
        uint8_t *mem_sprite = NULL;
        size_t mem_sprite_size = width * ((height + PAGE_BITS - 1) / PAGE_BITS);

        mem_sprite = malloc(mem_sprite_size);
        memset(mem_sprite, 0x00, mem_sprite_size);

        for (uint8_t cy = 0; cy < height; cy++) {
                uint8_t cpage = cy / PAGE_BITS;
                uint8_t sx = 0;
                uint8_t *src = sprite + (cy * pitch);
                uint8_t *dst = mem_sprite + (cpage * width);
                uint8_t src_mask = 0x80;
                uint8_t dst_mask = 1 << (cy & (PAGE_BITS - 1));
                for (uint8_t dx = 0; dx < width; dx++) {
                        if (*(src + sx) & src_mask)
                                *(dst + dx) |= dst_mask;
                        src_mask >>= 1;
                        if (!src_mask) {
                                src_mask = 0x80;
                                sx++;
                        }
                }
        }

        ret = rp2040_oled_draw_sprite(oled, mem_sprite, x, y, width, height, color);
        free(mem_sprite);
        return ret;
}
